[
  {
    "title": "CNBC Daily Open: Investors don't feel as threatened by Trump's tariffs",
    "description": "The danger of tariffs is still present, but other risks could cast a longer shadow over markets.",
    "publishedAt": "2025-05-26T01:26:00Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Bitcoin traders, here’s why you should brace for volatility",
    "description": "A rally led by the derivatives market could be masking underlying weakness in spot volumes.",
    "publishedAt": "2025-05-26T00:30:32Z",
    "sentiment": "POSITIVE"
  },
  {
    "title": "Rate 'rigging' traders say they were scapegoated",
    "description": "Tom Hayes and Carlo Palombo were among 37 City traders convicted, but claim unfair prosecution.",
    "publishedAt": "2025-05-25T23:04:07Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Entergy Louisiana and Entergy New Orleans force blackouts",
    "description": "Action taken as directed by MISO",
    "publishedAt": "2025-05-25T22:43:21Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Federal Reserve Chair Jerome Powell says he didn't major in economics",
    "description": "Jerome Powell told Princeton's graduates on Sunday of his uncertain future after his own graduation.",
    "publishedAt": "2025-05-25T22:07:00Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Walmart, Subaru, Mattel: These are the brands cutting jobs",
    "description": "Several household brand names have recently announced layoffs in response to macroeconomic pressures.",
    "publishedAt": "2025-05-25T20:17:21Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "What’s open and what’s closed this Memorial Day 2025",
    "description": "Businesses increasingly have chosen to stay open, but closures still affect many services.",
    "publishedAt": "2025-05-25T19:54:44Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Crypto market’s weekly winners and losers – SP Insights",
    "description": "After a volatile week of sharp moves, here’s who led the charts in the crypto world.",
    "publishedAt": "2025-05-25T19:05:32Z",
    "sentiment": "POSITIVE"
  },
  {
    "title": "'Big Pink' Serves as Symbol of Portland's 'Doom Loop'",
    "description": "US Bancorp Tower is just one of many buildings affected by a post-pandemic economic downturn.",
    "publishedAt": "2025-05-25T18:41:00Z",
    "sentiment": "POSITIVE"
  },
  {
    "title": "Scott Galloway says Musk's work at DOGE fueled his ego",
    "description": "During a recent Tesla earnings call, Musk said crypto distractions had no impact, but experts disagree.",
    "publishedAt": "2025-05-25T18:06:00Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Houston-area cities crack list of top places in U.S.",
    "description": "Three cities in Texas made the top 10, with two of them being part of the Houston metropolitan area.",
    "publishedAt": "2025-05-25T17:46:00Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Patients navigate an ‘absolutely insane’ maze for insulin",
    "description": "Health insurance plans are changing how they cover medications, making access more complex.",
    "publishedAt": "2025-05-25T17:21:48Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Millions of Americans hit with bad credit after pandemic",
    "description": "More than 2 million Americans’ credit scores were negatively affected due to pandemic relief ending.",
    "publishedAt": "2025-05-25T17:00:44Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "9 Menu Items You Should Always Avoid Ordering at Culver's",
    "description": "Beloved Midwestern staple Culver's is famous for ButterBurgers, but some items are better skipped.",
    "publishedAt": "2025-05-25T16:15:00Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Long-Bond Revolt Pressures 60/40 Comeback in Chaotic 2025 Market",
    "description": "A slump in the US long bond is clouding the comeback of a classic investment strategy.",
    "publishedAt": "2025-05-25T16:01:00Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "18 Items That Are Now So Expensive People Have Stopped Buying Them",
    "description": "I am sure most of us are going to feel the same way when we see what made this year’s list.",
    "publishedAt": "2025-05-25T15:31:02Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Go read this report on AI’s effects on Amazon’s warehouse workers",
    "description": "",
    "publishedAt": "2025-05-25T15:28:02Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "International flight diverted to Seattle after in-flight incident",
    "description": "A flight was diverted to Seattle after a passenger became disruptive midair, officials confirmed.",
    "publishedAt": "2025-05-25T15:15:50Z",
    "sentiment": "NEGATIVE"
  },
  {
    "title": "Chart of the Week: Wall Street Joins BTC Rally",
    "description": "Bitcoin hit new highs, but retail investors remain cautious amid institutional optimism.",
    "publishedAt": "2025-05-25T14:01:56Z",
    "sentiment": "NEGATIVE"
  }
]
